#!/usr/bin/perl
####  this program is written by Ang Tun Chek @2015
#### formula design based on
#### http://www.click108.com.tw/teaching/shiyea001.php
####  http://www.ceming.org/ziwei/
#### http://site.douban.com/108862/widget/notes/3928614/note/204288220/
###https://www.ptt.cc/man/Life/D3AF/M.1294834996.A.E89.html

use strict;
use Data::Dumper;
    use POSIX;
require "cal.pl";
require "ming_gong.pl";

##天干
 our @tian_gan = ( '甲', '乙', '丙', '丁', '戊', '己', '庚', '辛', '壬', '癸') ;
##地支
 our @di_zhi = ( '子','丑','寅','卯','辰','巳','午','未','申','酉','戌','亥') ;
##生肖 
our @animal =  ( '鼠','牛','虎','兔','龍','蛇','馬','羊','猴','雞','狗','豬');

##宫
our @gong = ('命宫','父母宫','福德宫','田宅宫','官禄宫','交友宫','迁移宫','疾厄宫','财帛宫','子女宫','夫妻宫','兄弟宫'); 

##陰煞
#our @yingsha=('寅', '子','戌','申','午','辰') ;

##时间
our $time ={
  24 => "子",
  1 => "丑",
  2 => "丑",
  3 => "寅",
  4 => "寅",
  5 => "卯",
  6 => "卯",
  7 => "辰",
  8 => "辰",
  9 => "巳",
  10 => "巳",
  11 => "午",
  12 => "午",
  13 => "未",
  14 => "未",
  15 => "申",
  16 => "申",
  17 => "酉",
  18 => "酉",
  19 => "戌",
  20 => "戌",
  21 => "亥",   
  22 => "亥",   
  23 => "子",   
};


our $property = {
  '子' =>{ 
		  yingyang => "阳",
		  property => "水",
		  "破碎"=> 3,
		  "孤辰"=>0,
		  "寡宿"=>8,
		  "天月"=>8,
 		  "蜚廉"=>6,

		  "天機" => "廟",
		  "天府" => "廟",
		  "太陰" => "廟",
		  "天相" => "廟",
		  "天梁" => "廟",
		  "破軍" => "廟",
		  "祿存" => "廟",

		  "武曲" => "旺",
		  "天同" => "旺",
		  "貪狼" => "旺",
		  "巨門" => "旺",
		  "七殺" => "旺",

		  "文昌" => "得",
		  "文曲" => "得",

		  "紫微" => "平",
		  "廉貞" => "平",

		  "太陽" => "陷",
		  "擎羊" => "陷",
		  "火星" => "陷",
		  "鈴星" => "陷",

		  "解神" => "廟",

		  "天刑" => "平",
		  "天姚" => "平",

		  "地劫" => "陷",
		  "天傷" => "陷",
		  "地空" => "陷",

###https://www.ptt.cc/man/Life/D3AF/M.1294834996.A.E89.html
 		  "天魁" => "旺",
# 		  "天鉞" => "",
 		  "化祿" => "平",
   		  "化權" => "闲",
 		  "化科" => "旺",
 		  "化忌" => "旺",
		  "紅鸞" => "廟",
		  "天喜" => "旺",
		  "左輔" => "旺",
		  "右弼" => "廟",
		  "天刑" => "平",
		  "天姚" => "陷",


	  },
    '丑' =>{ 
		  yingyang => "阴",
		  property => "土",
		  "破碎"=> 1,
		  "孤辰"=>0,
		  "寡宿"=>8,
		  "天月"=>3,
		  "蜚廉"=>7,

		  "紫微" => "廟",
		  "武曲" => "廟",
		  "天府" => "廟",
		  "太陰" => "廟",
		  "貪狼" => "廟",
		  "天相" => "廟",
		  "七殺" => "廟",
		  "文昌" => "廟",
		  "文曲" => "廟",
		  "擎羊" => "廟",
		  "陀羅" => "廟",

		  "天梁" => "旺",
		  "破軍" => "旺",

		  "火星" => "得",
		  "鈴星" => "得",

		  "廉貞" => "利",

		  "太陽" => "不",
		  "天同" => "不",
		  "巨門" => "不",

		  "天機" => "陷",

		  "天哭" => "廟",
		  "天虛" => "廟",
		  "地空" => "廟",
		  "紅鸞" => "廟",
		  "天喜" => "廟",

		  "天姚" => "陷",
		  "地劫" => "陷",
		  "天刑" => "陷",
		  "天使" => "陷",

###https://www.ptt.cc/man/Life/D3AF/M.1294834996.A.E89.html
 		  "天魁" => "旺",
# 		  "天鉞" => "",
 		  "化祿" => "廟",
   		  "化權" => "廟",
 		  "化科" => "旺",
 		  "化忌" => "廟",
		#  "紅鸞" => "廟",
		 # "天喜" => "旺",
		  "左輔" => "旺",
		  "右弼" => "廟",
		  "天刑" => "平",
		  "天姚" => "陷",
	    },

     '寅' =>{ 
		  yingyang => "阳",
		  property => "木",
		  "破碎"=> 7,
		  "孤辰"=>3,
		  "寡宿"=>11,
		  "天月"=>2,
		  "蜚廉"=>8,

		  "廉貞" => "廟",
		  "天府" => "廟",
		  "巨門" => "廟",
		  "天相" => "廟",
		  "天梁" => "廟",
		  "七殺" => "廟",
		  "火星" => "廟",
		  "鈴星" => "廟",
		  "祿存" => "廟",

		  "紫微" => "旺",
		  "太陽" => "旺",
		  "太陰" => "旺",

		  "天機" => "得",
		  "武曲" => "得",
		  "破軍" => "得",

		  "天同" => "利",

		  "貪狼" => "平",
		  "文曲" => "平",

		  "文昌" => "陷",
		  "陀羅" => "陷",

		  "天馬" => "廟",
		  "天刑" => "廟",
		  "解神" => "廟",
		  "地空" => "廟",
		  "天官" => "廟",
		  "天福" => "廟",
		  "紅鸞" => "廟",
		  "天喜" => "廟",

		  "地劫" => "平",
		  "天姚" => "平",

###https://www.ptt.cc/man/Life/D3AF/M.1294834996.A.E89.html
# 		  "天魁" => "旺",
		  "天鉞" => "旺",
 		  "化祿" => "平",
   		  "化權" => "旺",
 		  "化科" => "旺",
 		  "化忌" => "陷",
#	 	  "紅鸞" => "廟",
#		  "天喜" => "旺",
		  "左輔" => "廟",
		  "右弼" => "旺",
#		  "天刑" => "陷",
#		  "天姚" => "平",

	    },
    '卯' =>{ 
		  yingyang => "阴",
		  property => "木",
		  "破碎"=> 3,
		  "孤辰"=>3,
		  "寡宿"=>11,
		  "天月"=>0,
		  "蜚廉"=>3,

		  "太陽" => "廟",
		  "巨門" => "廟",
		  "天梁" => "廟",
		  "祿存" => "廟",

		  "紫微" => "旺",
		  "天機" => "旺",
		  "七殺" => "旺",
		  "文曲" => "旺",

		  "天府" => "得",

		  "武曲" => "利",
		  "貪狼" => "利",
		  "文昌" => "利",
		  "火星" => "利",
		  "鈴星" => "利",

		  "天同" => "平",
		  "廉貞" => "平",

		  "太陰" => "陷",
		  "天相" => "陷",
		  "破軍" => "陷",
		  "擎羊" => "陷",

		  "天刑" => "廟",
		  "解神" => "廟",
		  "天姚" => "廟",
		  "天哭" => "廟",
		  "天虛" => "廟",
		  "紅鸞" => "廟",
		  "天喜" => "廟",

		  "地劫" => "平",

		  "天傷" => "陷",
		  "天使" => "陷",
		  "地空" => "陷",

###https://www.ptt.cc/man/Life/D3AF/M.1294834996.A.E89.html
 		  "天魁" => "廟",
#		  "天鉞" => "旺",
 		  "化祿" => "闲",
   		  "化權" => "旺",
 		  "化科" => "廟",
 		  "化忌" => "旺",
#	 	  "紅鸞" => "廟",
#		  "天喜" => "旺",
		  "左輔" => "陷",
		  "右弼" => "陷",
#		  "天刑" => "陷",
#		  "天姚" => "平",
	    },
   '辰' =>{ 
		  yingyang => "阳",
		  property => "土",
		  "破碎"=> 1,
		  "孤辰"=>3,
		  "寡宿"=>11,
		  "天月"=>5,
		  "蜚廉"=>4,

		  "武曲" => "廟",
		  "天府" => "廟",
		  "貪狼" => "廟",
		  "天梁" => "廟",
		  "七殺" => "廟",
		  "擎羊" => "廟",
		  "陀羅" => "廟",

		  "太陽" => "旺",
		  "破軍" => "旺",

		  "紫微" => "得",
		  "天相" => "得",
		  "文昌" => "得",
		  "文曲" => "得",

		  "天機" => "利",
		  "廉貞" => "利",

		  "天同" => "平",

		  "太陰" => "陷",
		  "巨門" => "陷",
		  "火星" => "陷",
		  "鈴星" => "陷",

		  "解神" => "廟",
		  "地劫" => "廟",
		  "紅鸞" => "廟",
		  "天喜" => "廟",

		  "天刑" => "平",
		  "天姚" => "平",

		  "地空" => "陷",
		  "天傷" => "陷",
		  "天使" => "陷",

###https://www.ptt.cc/man/Life/D3AF/M.1294834996.A.E89.html
# 		  "天魁" => "廟",
#		  "天鉞" => "旺",
 		  "化祿" => "廟",
   		  "化權" => "平",
 		  "化科" => "廟",
 		  "化忌" => "闲",
#	 	  "紅鸞" => "廟",
#		  "天喜" => "旺",
		  "左輔" => "廟",
		  "右弼" => "廟",
#		  "天刑" => "陷",
#		  "天姚" => "平",
	    },
    '巳' =>{ 
		  yingyang => "阳",
		  property => "火",
		  "破碎"=> 7,
		  "孤辰"=>6,
		  "寡宿"=>2,
		  "天月"=>1,
		  "蜚廉"=>5,

		  "天同" => "廟",
		  "文昌" => "廟",
		  "文曲" => "廟",
		  "祿存" => "廟",

		  "紫微" => "旺",
		  "太陽" => "旺",
		  "巨門" => "旺",

		  "天府" => "得",
		  "天相" => "得",
		  "火星" => "得",
		  "鈴星" => "得",

		  "天機" => "平",
		  "武曲" => "平",
		  "破軍" => "平",
		  "七殺" => "平",

		  "廉貞" => "陷",
		  "太陰" => "陷",
		  "貪狼" => "陷",
		  "天梁" => "陷",
		  "陀羅" => "陷",

		  "地空" => "廟",
		  "天官" => "廟",
		  "天福" => "廟",

		  "地劫" => "平",
		  "天馬" => "平",
		  "天刑" => "平",
		  "天姚" => "平",

###https://www.ptt.cc/man/Life/D3AF/M.1294834996.A.E89.html
# 		  "天魁" => "廟",
		  "天鉞" => "旺",
 		  "化祿" => "地",
   		  "化權" => "平",
 		  "化科" => "閑",
 		  "化忌" => "陷",
#	 	  "紅鸞" => "廟",
#		  "天喜" => "旺",
		  "左輔" => "平",
		  "右弼" => "平",
#		  "天刑" => "陷",
#		  "天姚" => "平",

	    },
    '午' =>{ 
		  yingyang => "阴",
		  property => "火",
		  "破碎"=> 3,
		  "孤辰"=>6,
		  "寡宿"=>2,
		  "天月"=>9,
		  "蜚廉"=>0,

		  "紫微" => "廟",
		  "天機" => "廟",
		  "天相" => "廟",
		  "天梁" => "廟",
		  "破軍" => "廟",
		  "祿存" => "廟",
		  "火星" => "廟",
		  "鈴星" => "廟",

		  "太陽" => "旺",
		  "武曲" => "旺",
		  "天府" => "旺",
		  "貪狼" => "旺",
		  "巨門" => "旺",
		  "七殺" => "旺",

		  "廉貞" => "平",

		  "太陰" => "不",

		  "天同" => "陷",
		  "文昌" => "陷",
		  "文曲" => "陷",
		  "擎羊" => "陷",

		  "地空" => "廟",
		  "解神" => "廟",

		  "天刑" => "平",
		  "天姚" => "平",

		  "天傷" => "陷",

###https://www.ptt.cc/man/Life/D3AF/M.1294834996.A.E89.html
 		  "天魁" => "廟",
#		  "天鉞" => "旺",
 		  "化祿" => "平",
   		  "化權" => "廟",
 		  "化科" => "廟",
 		  "化忌" => "陷",
#	 	  "紅鸞" => "廟",
#		  "天喜" => "旺",
		  "左輔" => "旺",
		  "右弼" => "旺",
#		  "天刑" => "陷",
#		  "天姚" => "平",

	    },
   '未' =>{ 
		  yingyang => "阴",
		  property => "土",
		  "破碎"=> 1,
		  "孤辰"=>6,
		  "寡宿"=>2,
 		  "天月"=>5,
		  "蜚廉"=>1,

		  "紫微" => "廟",
		  "武曲" => "廟",
		  "天府" => "廟",
		  "貪狼" => "廟",
		  "七殺" => "廟",
		  "擎羊" => "廟",
		  "陀羅" => "廟",

		  "天梁" => "旺",
		  "破軍" => "旺",
		  "文曲" => "旺",

		  "太陽" => "得",
		  "天相" => "得",

		  "廉貞" => "利",
		  "文昌" => "利",
		  "火星" => "利",
		  "鈴星" => "利",

		  "天同" => "不",
		  "太陰" => "不",
		  "巨門" => "不",

		  "天機" => "陷",

		  "地劫" => "平",

		  "天刑" => "陷",
		  "天傷" => "陷",
		  "地空" => "陷",
		  "天姚" => "陷",

###https://www.ptt.cc/man/Life/D3AF/M.1294834996.A.E89.html
# 		  "天魁" => "廟",
		  "天鉞" => "旺",
 		  "化祿" => "廟",
   		  "化權" => "旺",
 		  "化科" => "旺",
 		  "化忌" => "旺",
#	 	  "紅鸞" => "廟",
#		  "天喜" => "旺",
		  "左輔" => "廟",
		  "右弼" => "廟",
#		  "天刑" => "陷",
#		  "天姚" => "平",
	    },
    '申' =>{ 
		  yingyang => "阳",
		  property => "金",
		  "破碎"=> 7,
		  "孤辰"=>9,
		  "寡宿"=>5,
 		  "天月"=>0,
		  "蜚廉"=>2,

		  "廉貞" => "廟",
		  "巨門" => "廟",
		  "天相" => "廟",
		  "七殺" => "廟",
		  "祿存" => "廟",

		  "紫微" => "旺",
		  "天同" => "旺",

		  "天機" => "得",
		  "太陽" => "得",
		  "武曲" => "得",
		  "天府" => "得",
		  "破軍" => "得",
		  "文曲" => "得",
		  "文昌" => "得",

		  "太陰" => "利",

		  "貪狼" => "平",

		  "天梁" => "陷",
		  "陀羅" => "陷",
		  "火星" => "陷",
		  "鈴星" => "陷",

		  "天官" => "廟",
		  "天馬" => "廟",
		  "天福" => "廟",
		  "天哭" => "廟",
		  "天虛" => "廟",

		  "天刑" => "平",
		  "天姚" => "平",

		  "地空" => "陷",

###https://www.ptt.cc/man/Life/D3AF/M.1294834996.A.E89.html
# 		  "天魁" => "廟",
		  "天鉞" => "廟",
 		  "化祿" => "廟",
   		  "化權" => "旺",
 		  "化科" => "廟",
 		  "化忌" => "陷",
#	 	  "紅鸞" => "廟",
#		  "天喜" => "旺",
		  "左輔" => "平",
		  "右弼" => "閑",
#		  "天刑" => "陷",
#		  "天姚" => "平",
	    },
   '酉' =>{ 
		  yingyang => "阴",
		  property => "金",
		  "破碎"=> 3,
		  "孤辰"=>9,
		  "寡宿"=>5,
		  "天月"=>4,
		  "蜚廉"=>9,

		  "巨門" => "廟",
		  "文曲" => "廟",
		  "文昌" => "廟",
		  "祿存" => "廟",

		  "紫微" => "旺",
		  "天機" => "旺",
		  "天府" => "旺",
		  "太陰" => "旺",
		  "七殺" => "旺",

		  "天梁" => "得",
		  "火星" => "得",
		  "鈴星" => "得",

		  "武曲" => "利",
		  "貪狼" => "利",

		  "太陽" => "平",
		  "天同" => "平",
		  "廉貞" => "平",

		  "天相" => "陷",
		  "破軍" => "陷",
		  "擎羊" => "陷",

		  "地空" => "廟",
		  "天刑" => "廟",
		  "天姚" => "廟",

		  "地劫" => "平",

		  "天使" => "陷",

###https://www.ptt.cc/man/Life/D3AF/M.1294834996.A.E89.html
# 		  "天魁" => "廟",
		  "天鉞" => "廟",
 		  "化祿" => "平",
   		  "化權" => "平",
 		  "化科" => "平",
 		  "化忌" => "陷",
#	 	  "紅鸞" => "廟",
#		  "天喜" => "旺",
		  "左輔" => "陷",
		  "右弼" => "陷",
#		  "天刑" => "陷",
#		  "天姚" => "平",
	    },
     '戌' =>{ 
		  yingyang => "阳",
		  property => "土",
		  "破碎"=> 1,
		  "孤辰"=>9,
		  "寡宿"=>5,
		  "天月"=>8,
		  "蜚廉"=>10,

		  "武曲" => "廟",
		  "天府" => "廟",
		  "貪狼" => "廟",
		  "天梁" => "廟",
		  "七殺" => "廟",
		  "擎羊" => "廟",
		  "陀羅" => "廟",
		  "火星" => "廟",
		  "鈴星" => "廟",

		  "太陰" => "旺",
		  "破軍" => "旺",

		  "紫微" => "得",
		  "天相" => "得",

		  "天機" => "利",
		  "廉貞" => "利",

		  "天同" => "平",

		  "太陽" => "不",

		  "巨門" => "陷",
		  "文曲" => "陷",
		  "文昌" => "陷",

		  "解神" => "廟",
		  "天刑" => "廟",
		  "地空" => "廟",
		  "天姚" => "廟",
		  "紅鸞" => "廟",
		  "天喜" => "廟",

		  "地劫" => "平",

		  "天使" => "陷",

###https://www.ptt.cc/man/Life/D3AF/M.1294834996.A.E89.html
# 		  "天魁" => "廟",
#		  "天鉞" => "廟",
 		  "化祿" => "廟",
   		  "化權" => "廟",
 		  "化科" => "旺",
 		  "化忌" => "陷",
#	 	  "紅鸞" => "廟",
#		  "天喜" => "旺",
		  "左輔" => "廟",
		  "右弼" => "廟",
#		  "天刑" => "陷",
#		  "天姚" => "平",
	    },
      '亥' =>{ 
		  yingyang => "阴",
		  property => "水",
		  "破碎"=> 7,
		  "孤辰"=>0,
		  "寡宿"=>8,
		  "天月"=>0,
		  "蜚廉"=>11,

		  "天同" => "廟",
		  "太陰" => "廟",
		  "祿存" => "廟",

		  "紫微" => "旺",
		  "巨門" => "旺",
		  "文曲" => "旺",

		  "天府" => "得",
		  "天相" => "得",

		  "文昌" => "利",
		  "火星" => "利",
		  "鈴星" => "利",

		  "天機" => "平",
		  "武曲" => "平",
		  "七殺" => "平",
		  "破軍" => "平",

		  "太陽" => "陷",
		  "廉貞" => "陷",
		  "貪狼" => "陷",
		  "天梁" => "陷",
		  "陀羅" => "陷",

		  "天姚" => "廟",
		  "紅鸞" => "廟",
		  "天喜" => "廟",

		  "天馬" => "平",
		  "天刑" => "平",

		  "地空" => "陷",
		  "地劫" => "陷",

###https://www.ptt.cc/man/Life/D3AF/M.1294834996.A.E89.html
# 		  "天魁" => "廟",
		  "天鉞" => "旺",
 		  "化祿" => "廟",
   		  "化權" => "旺",
 		  "化科" => "旺",
 		  "化忌" => "陷",
#	 	  "紅鸞" => "廟",
#		  "天喜" => "旺",
		  "左輔" => "閑",
		  "右弼" => "平",
#		  "天刑" => "陷",
#		  "天姚" => "平",
	    },



    '甲' =>{ 
		  yingyang => "阳",
		  property => "木",
		  gong_gan =>"丙",
		  "祿" => "廉貞",
		  "權" => "破軍",
		  "科" => "武曲",
		  "忌" => "太陽",

		  "天鉞" => "5",##未
		  "天魁" => "11",##丑
		  "陀羅" => "11",##丑
		  "擎羊" => "1",##卯
		  "祿存" => "0",##寅
		     
		  "截空" => "6",
		  "紅艷" => "4",
		  "天官" => "5",
 		  "天福" => "7",


	    },
    '乙' =>{ 
		  yingyang => "阴",
		  property => "木",
		  gong_gan =>"戊",
		  "祿" => "天機",
		  "權" => "天梁",
		  "科" => "紫微",
		  "忌" => "太陰",

		  "天鉞" => "6",##申
		  "天魁" => "10",##子
		  "陀羅" => "0",##寅
		  "擎羊" => "2",##辰
		  "祿存" => "1",##卯
		  "截空" => "4",

 		  "紅艷" => "4",
 		  "天官" => "3",
 		  "天福" => "6",



	    },
    '丙' =>{ 
		  yingyang => "阳",
		  property => "火",
		  gong_gan =>"庚",
		  "祿" => "天同",
		  "權" => "天機",
		  "科" => "文昌",
		  "忌" => "廉貞",

		  "天鉞" => "7",##酉
		  "天魁" => "9",##亥
		  "陀羅" => "2",##辰
		  "擎羊" => "4",##午
		  "祿存" => "3",##巳
		  "截空" => "2",

		  "紅艷" => "0",
		  "天官" => "3",
		  "天福" => "10",


	    },
    '丁' =>{ 
		  yingyang => "阴",
		  property => "火",
		  gong_gan =>"壬",
		  "祿" => "太陰",
		  "權" => "天同",
		  "科" => "天機",
		  "忌" => "巨門",

		  "天鉞" => "7",##酉
		  "天魁" => "9",##亥
		  "陀羅" => "3",##巳
		  "擎羊" => "5",##未
		  "祿存" => "4",##午

		  "截空" => "0",
 		  "紅艷" => "5",
		  "天官" => "0",
		  "天福" => "9",


	    },
    '戊' =>{ 
		  yingyang => "阳",
		  property => "土",
		  gong_gan =>"甲",
		  "祿" => "貪狼",
		  "權" => "太陰",
		  "科" => "右弼",
		  "忌" => "天機",

		  "天鉞" => "5",##未
		  "天魁" => "11",##丑
		  "陀羅" => "2",##辰
		  "擎羊" => "4",##午
		  "祿存" => "3",##巳

		  "截空" => "10",
 		  "紅艷" => "2",
		  "天官" => "1",
		  "天福" => "1",

	    },
    '己' =>{ 
		  yingyang => "阴",
		  property => "土",
		  gong_gan =>"丙",
		  "祿" => "武曲",
		  "權" => "貪狼",
		  "科" => "天梁",
		  "忌" => "文曲",

		  "天鉞" => "6",##申
		  "天魁" => "10",##子
		  "陀羅" => "3",##巳
		  "擎羊" => "5",##未
		  "祿存" => "4",##午

		  "截空" => "7",
 		  "紅艷" => "2",
		  "天官" => "7",
		  "天福" => "0",

	    },
    '庚' =>{ 
		  yingyang => "阳",
		  property => "金",
		  gong_gan =>"戊",
		  "祿" => "太陽",
		  "權" => "武曲",
		  "科" => "太陰",
		  "忌" => "天同",

		  "天鉞" => "4",##午
		  "天魁" => "0",##寅
		  "陀羅" => "5",##未
		  "擎羊" => "7",##酉
		  "祿存" => "6",##申

		  "截空" => "5",
  		  "紅艷" => "8",
		  "天官" => "9",
		  "天福" => "4",

	    },
    '辛' =>{ 
		  yingyang => "阴",
		  property => "金",
		  gong_gan =>"庚",
		  "祿" => "巨門",
		  "權" => "太陽",
		  "科" => "文曲",
		  "忌" => "文昌",

		  "天鉞" => "4",##午
		  "天魁" => "0",##寅
		  "陀羅" => "5",##申
		  "擎羊" => "7",##戌
		  "祿存" => "6",##酉

		  "截空" => "3",
  		  "紅艷" => "7",
		  "天官" => "7",
		  "天福" => "3",

	    },
   '壬' =>{ 
		  yingyang => "阳",
		  property => "水",
		  gong_gan =>"壬",
		  "祿" => "天梁",
		  "權" => "紫微",
		  "科" => "左輔",
		  "忌" => "武曲",

		  "天鉞" => "3",##巳
		  "天魁" => "1",##卯
		  "陀羅" => "8",##戌
		  "擎羊" => "10",##子
		  "祿存" => "9",##亥

		  "截空" => "1",
  		  "紅艷" => "10",
		   "天官" => "8",  
		  "天福" => "4",

	    },
    '癸' =>{ 
		  yingyang => "阴",
		  property => "水",
		  gong_gan =>"甲",
		  "祿" => "破軍",
		  "權" => "巨門",
		  "科" => "太陰",
		  "忌" => "貪狼",

		  "天鉞" => "3",##巳
		  "天魁" => "1",##卯
		  "陀羅" => "9",##亥
		  "擎羊" => "11",##丑
		  "祿存" => "10",##子

		  "截空" => "11",
  		  "紅艷" => "6",
		  "天官" => "4",
		  "天福" => "3",


	    },
};

##局数
our $ju_su={
    '水' =>2,
    '木' =>3,
    '金' =>4,
    '土' =>5,
    '火' =>6,

};

##六十甲子
our $sixty = {
      '甲子乙丑'=> "金", 
      '壬申癸酉'=> "金", 
      '庚辰辛巳'=> "金", 
      '甲午乙未'=> "金",
      '庚戌辛亥'=> "金",
      '壬寅癸卯'=> "金",

      '丙寅丁卯'=> "火",
      '甲戌乙亥'=> "火",
      '戊子己丑'=> "火", 
      '丙申丁酉'=> "火", 
      '甲辰乙巳'=> "火", 
      '戊午己未'=> "火",

      '戊辰己巳'=> "木", 
      '壬午癸未'=> "木",
      '庚寅辛卯'=> "木",
      '戊戌己亥'=> "木",
      '壬子癸丑'=> "木", 
      '庚申辛酉'=> "木",

      '庚午辛未'=> "土",
      '戊寅己卯'=> "土",
      '丙戌丁亥'=> "土",
      '庚子辛丑'=> "土", 
      '戊申己酉'=> "土", 
      '丙辰丁巳'=> "土", 

      '丙子丁丑'=> "水", 
      '甲申乙酉'=> "水", 
      '壬辰癸巳'=> "水", 
      '丙午丁未'=> "水",
      '甲寅乙卯'=> "水",
      '壬戌癸亥'=> "水",

};

##紫微宫
our $ziwei={
  1=> {
	  "水"=>"丑",
	  "木"=>"辰",
	  "金"=>"亥",
	  "土"=>"午",
	  "火"=>"酉",
    },
  2=> {
	  "水"=>"寅",
	  "木"=>"丑",
	  "金"=>"辰",
	  "土"=>"亥",
	  "火"=>"午",
	  
    },
  3=> {
	  "水"=>"寅",
	  "木"=>"寅",
	  "金"=>"丑",
	  "土"=>"辰",
	  "火"=>"亥",
	  
    },
 4=> {
	  "水"=>"卯",
	  "木"=>"巳",
	  "金"=>"寅",
	  "土"=>"丑",
	  "火"=>"辰",
	  
    },
  5=> {
	  "水"=>"卯",
	  "木"=>"寅",
	  "金"=>"子",
	  "土"=>"寅",
	  "火"=>"丑",
	  
    },
  6=> {
	  "水"=>"辰",
	  "木"=>"卯",
	  "金"=>"巳",
	  "土"=>"未",
	  "火"=>"寅",
	  
    },
 7=> {
	  "水"=>"辰",
	  "木"=>"午",
	  "金"=>"寅",
	  "土"=>"子",
	  "火"=>"戌",
	  
    },
  8=> {
	  "水"=>"巳",
	  "木"=>"卯",
	  "金"=>"卯",
	  "土"=>"巳",
	  "火"=>"未",
	  
    },
  9=> {
	  "水"=>"巳",
	  "木"=>"辰",
	  "金"=>"丑",
	  "土"=>"寅",
	  "火"=>"子",
	  
    },
 10=> {
	  "水"=>"午",
	  "木"=>"未",
	  "金"=>"午",
	  "土"=>"卯",
	  "火"=>"巳",
	  
    },
 11=> {
	  "水"=>"午",
	  "木"=>"辰",
	  "金"=>"卯",
	  "土"=>"申",
	  "火"=>"寅",
	  
    },
 12=> {
	  "水"=>"未",
	  "木"=>"巳",
	  "金"=>"辰",
	  "土"=>"丑",
	  "火"=>"卯",
	  
    },
13=> {
	  "水"=>"未",
	  "木"=>"申",
	  "金"=>"寅",
	  "土"=>"午",
	  "火"=>"亥",
	  
    },
 14=> {
	  "水"=>"申",
	  "木"=>"巳",
	  "金"=>"未",
	  "土"=>"卯",
	  "火"=>"申",
	  
    },
 15=> {
	  "水"=>"申",
	  "木"=>"午",
	  "金"=>"辰",
	  "土"=>"辰",
	  "火"=>"丑",
	  
    },
 16=> {
	  "水"=>"酉",
	  "木"=>"酉",
	  "金"=>"巳",
	  "土"=>"酉",
	  "火"=>"午",
	  
    },
17=> {
	  "水"=>"酉",
	  "木"=>"午",
	  "金"=>"卯",
	  "土"=>"寅",
	  "火"=>"卯",
	  
    },
 18=> {
	  "水"=>"戌",
	  "木"=>"未",
	  "金"=>"申",
	  "土"=>"未",
	  "火"=>"辰",
	  
    },
 19=> {
	  "水"=>"戌",
	  "木"=>"戌",
	  "金"=>"巳",
	  "土"=>"辰",
	  "火"=>"子",
	  
    },
20=> {
	  "水"=>"亥",
	  "木"=>"未",
	  "金"=>"午",
	  "土"=>"巳",
	  "火"=>"酉",
	  
    },
21=> {
	  "水"=>"亥",
	  "木"=>"申",
	  "金"=>"辰",
	  "土"=>"戌",
	  "火"=>"寅",
	  
    },
22=> {
	  "水"=>"子",
	  "木"=>"亥",
	  "金"=>"酉",
	  "土"=>"卯",
	  "火"=>"未",
	  
    },
23=> {
	  "水"=>"子",
	  "木"=>"申",
	  "金"=>"午",
	  "土"=>"申",
	  "火"=>"辰",
	  
    },
24=> {
	  "水"=>"丑",
	  "木"=>"酉",
	  "金"=>"未",
	  "土"=>"巳",
	  "火"=>"巳",
	  
    },

25=> {
	  "水"=>"丑",
	  "木"=>"子",
	  "金"=>"巳",
	  "土"=>"午",
	  "火"=>"丑",
	  
    },
26=> {
	  "水"=>"寅",
	  "木"=>"酉",
	  "金"=>"戌",
	  "土"=>"亥",
	  "火"=>"戌",
	  
    },

27=> {
	  "水"=>"寅",
	  "木"=>"戌",
	  "金"=>"未",
	  "土"=>"辰",
	  "火"=>"卯",
	  
    },
28=> {
	  "水"=>"卯",
	  "木"=>"丑",
	  "金"=>"申",
	  "土"=>"酉",
	  "火"=>"申",
	  
    },
29=> {
	  "水"=>"卯",
	  "木"=>"戌",
	  "金"=>"午",
	  "土"=>"午",
	  "火"=>"巳",
	  
    },
30=> {
	  "水"=>"辰",
	  "木"=>"亥",
	  "金"=>"亥",
	  "土"=>"未",
	  "火"=>"午",
	  
    },

};

#五行相生
our $grow ={
      "木"=>"火",
      "火"=>"土",
      "土"=>"金",
      "金"=>"水",
      "水"=>"木",

      "财"=>"官",
      "官"=>"印",
      "印"=>"比劫",
      "比劫"=>"食伤",
      "食伤"=>"财",

};

#五行相克
our $vs={
      "木"=>"土",
      "火"=>"金",
      "土"=>"水",
      "金"=>"木",
      "水"=>"火",


      "财"=>"印",
      "官"=>"比劫",
      "印"=>"食伤",
      "比劫"=>"财",
      "食伤"=>"官",

};

#找时辰
sub find_time(){
   my(%params) = @_;
   my $t = $params{hour} ;
   return $time->{$t};


}

#find array value position
sub find_pos(){
  my(%params) = @_;
   my @a = @{$params{q}};

  for my $i (0..scalar(@a)-1){
      if($a[$i] eq $params{f}){
	return $i;
      }
  }

  return -1;
}


# #rotate an array by starting point
# sub grab_and_rotate ( ) {
#   my(%params) = @_;
# 
#    # print Dumper($params{q});
#         my $listref = $params{q};
#    my $element = $listref->[$params{start}];
#     push(@$listref, shift @$listref);
#     return $element;
# }

sub combination(){
   my(%params) = @_;
 my $t_count =0;
  my $d_count=0;

    for my $i (0..59){
	#print $params{tian}.$tian_gan[$t_count] ."-----".$params{di}.$di_zhi[$d_count]."";
	if ($params{tian} eq  $tian_gan[$t_count] && $params{di} eq  $di_zhi[$d_count]) {
	  return $i;
	}else{
		$t_count++ ;
	  if ($t_count eq scalar(@tian_gan) ){
	      $t_count=0;
	    }
	      $d_count++; 
	   if ($d_count eq scalar(@di_zhi) ) {
	      $d_count=0;
	    }
	}
    }
  return -1;
}
####################################################################################

sub gong_wei (){
       my(%params) = @_;

      my $you = $params{you};
      my $gong = $params{gong};

      my $pos = $you->{gong_wei}->{$gong};
      #print $pos."";
      foreach my $k  (keys %{$you->{ziwei}}){
		#print $k."";
	   if($you->{ziwei}->{$k}->{pos} eq $pos){
		print $k;
		if($you->{ziwei}->{$k}->{bright}){
		    print $you->{ziwei}->{$k}->{bright};
		}
		if($you->{ziwei}->{$k}->{hua_ji}){
		    print $you->{ziwei}->{$k}->{hua_ji};
		}
	      print "\n";
	   }
      }

      
}



sub process(){
       my(%params) = @_;

      my $you;

      my ($my_year, $my_month, $my_date,$my_hour,$my_min,$sex) = ($params{year},$params{month},$params{date},$params{hour},$params{min},$params{sex});
      #my ($my_year, $my_month, $my_date,$my_hour,$my_min,$sex) = (1978,11,9,11,11,1);
      #my ($my_year, $my_month, $my_date,$my_hour,$my_min,$sex) = (1977,8,25,14,20,0);

	$you->{sex} = $sex;
	$you->{time}= &find_time("hour"=>$my_hour,"min"=>$my_min);
      #print Dumper($you->{time});
	($you->{lyear}, $you->{month}, $you->{day}, $you->{isleapmonth}) = &solar2Lunar( $my_year, $my_month, $my_date );
      ($you->{tian_gan},$you->{di_zhi},$you->{animal}) = &LunarYear( $my_year, $my_month, $my_date );   


      #农历的年份表示
      #  $you->{date} = &strLunarDate( $you->{lyear}, $you->{month}, $you->{isleapmonth} );    #农历的月日表示
	  $you->{sex_yingyang} = $property->{$you->{tian_gan}}->{yingyang};

      #####由地支建立宫干
      my $process;
      # my @dz=@di_zhi;
      # for my $i (0..11) {
      #     $process = &grab_and_rotate("q" => \@dz,"start"=>2 );
      #     #print "Handling process $i $process";
      #     $you ->{gong_gan}->{$i} = $process;
      # }

	  my  $i=0;
	      foreach my $z (@di_zhi){
		  $you->{gong_gan}->{ ($i-2 )%12} =  $z ;
		  $i++;
	      }


      #####五虎遁訣求宮干
      #####根据八字的天干 找宫干 建立命盤
      my $f=&find_pos("q"=> \@tian_gan, "f"=>$property->{$you->{tian_gan}}->{gong_gan} );

      # my @tg = @tian_gan;
      # for my $i (0..11) {
      #     $process = &grab_and_rotate("q" => \@tg,"start"=>$f);
      #     #print "Handling process $i $process";
      #     $you ->{gong_gan}->{$i} = $process.$you ->{gong_gan}->{$i};
      # }

      for my $i (0..11) {
		  $you->{gong_gan}->{$i} =  $tian_gan[$f].$you ->{gong_gan}->{$i} ;
		  $f = ($f+1)%10;
	      }


      ###【順數生月，逆數生時】求命宮

      my $time_num = &find_pos("q"=> \@di_zhi, "f"=>$you->{time});
      ###順數生月
      my $count = ($you->{month}-$time_num);

      for my $i (0..11){
      ###逆數生時
	#$you ->{gong_wei}->{($count-2)%12} =$gong[$i];
	  $you ->{gong_wei}->{$gong[$i]}=($count-1)%12;
	  $count++;
	  if($count == 12){
	    $count =0;
	  }

      }


      ##六十甲子納音表2：
	##求局数

      my $count = (($you->{month}+12-$time_num)-1)%12;
      my $gong_gan = $you->{gong_gan}->{$count};

	foreach my $k (keys %{$sixty}){
	if($k =~ /$gong_gan/){
	    $you->{ju_su} = $sixty->{$k};
	    $you->{ju_su_num} = $ju_su->{$sixty->{$k}};
	#    exit;
	    }
	}


      # 找紫微星
      my $ziwei_pos;
      for my $i (0..11){
	  if( $you->{gong_gan}->{$i} =~ /$ziwei->{$you->{day}}->{$you->{ju_su}}/){
		$ziwei_pos = $i;
		print $you->{gong_gan}->{$i} ."-------".$i;
		last;
	    }
      }
   #   print "--------".$my_year."--------".$ziwei_pos."--------".$you->{day}."----------".$count."--------".$you->{ju_su}."\n";

      $you->{ziwei}->{"紫微"}->{pos} = $ziwei_pos % 12;
      $you->{ziwei}->{"天機"}->{pos} = ($ziwei_pos+11) % 12;
      $you->{ziwei}->{"太陽"}->{pos} = ($ziwei_pos+9) % 12;
      $you->{ziwei}->{"武曲"}->{pos} = ($ziwei_pos+8)% 12;
      $you->{ziwei}->{"天同"}->{pos} = ($ziwei_pos+7) % 12;
      $you->{ziwei}->{"廉貞"}->{pos} = ($ziwei_pos+4) % 12;


      ##找天府星

      if($ziwei_pos == 0 || $ziwei_pos == 6){
	$you->{ziwei}->{"天府"}->{pos} = $ziwei_pos*1;
      }else{
      $you->{ziwei}->{"天府"}->{pos} = (12-$ziwei_pos)   % 12 *1;

      }
      $you->{ziwei}->{"太陰"}->{pos} = ($you->{ziwei}->{"天府"}->{pos} +1)%12 ;
      $you->{ziwei}->{"貪狼"}->{pos} = ($you->{ziwei}->{"天府"}->{pos} +2)%12;
      $you->{ziwei}->{"巨門"}->{pos} = ($you->{ziwei}->{"天府"}->{pos}+3) % 12;
      $you->{ziwei}->{"天相"}->{pos} = ($you->{ziwei}->{"天府"}->{pos}+4) % 12;
      $you->{ziwei}->{"天梁"}->{pos} = ($you->{ziwei}->{"天府"}->{pos}+5) % 12;
      $you->{ziwei}->{"七殺"}->{pos} = ($you->{ziwei}->{"天府"}->{pos}+6) % 12;
      $you->{ziwei}->{"破軍"}->{pos} = ($you->{ziwei}->{"天府"}->{pos}+10) % 12 ;

      $you->{ziwei}->{$property->{$you->{tian_gan}}->{"祿"} }->{hua_ji} ="祿";
      $you->{ziwei}->{$property->{$you->{tian_gan}}->{"科"} }->{hua_ji} ="科";
      $you->{ziwei}->{$property->{$you->{tian_gan}}->{"忌"} }->{hua_ji} ="忌";
      $you->{ziwei}->{$property->{$you->{tian_gan}}->{"權"} }->{hua_ji} ="權";

      #####三合########
      #print Dumper(12-$time_num."---".(&find_pos("q"=> \@di_zhi, "f"=>"戌")-2));

      $you->{ziwei}->{"文曲"}->{pos} = (&find_pos("q"=> \@di_zhi, "f"=>"辰") -2    +$time_num )% 12 ;
      $you->{ziwei}->{"文昌"}->{pos} = (&find_pos("q"=> \@di_zhi, "f"=>"戌") -2 +12 - $time_num ) % 12;
      $you->{ziwei}->{"左輔"}->{pos} = (&find_pos("q"=> \@di_zhi, "f"=>"辰") -2 +$you->{month}-1 )% 12;
      $you->{ziwei}->{"右弼"}->{pos} = (&find_pos("q"=> \@di_zhi, "f"=>"戌") -2 +12 - $you->{month} ) % 12 +1;

      
      # ##地劫 = 文曲+ 7步
      $you->{ziwei}->{"地劫"}->{pos} = ($you->{ziwei}->{"文曲"}->{pos} +7) %12;
      # ##地空= 文昌 + 1步
      $you->{ziwei}->{"地空"}->{pos} = ($you->{ziwei}->{"文昌"}->{pos} +1) %12;
      # ##天空= 在亥上起子逆行算到生時安之
      $you->{ziwei}->{"天空"}->{pos} = (&find_pos("q"=> \@di_zhi, "f"=>"亥") -2 +12 - $time_num ) % 12;
      # ##天姚 = 出生月 + 1步
      $you->{ziwei}->{"天姚"}->{pos} = ($you->{month}-3 +1) %12;

      ##天刑 = 出生月 + 9步
      $you->{ziwei}->{"天刑"}->{pos} = ($you->{month}-3 +9) %12;

      ##陰煞 = 寅位 - （（出生月-7）*2）步
      $you->{ziwei}->{"陰煞"}->{pos} = (12 - (($you->{month} %6)-1)*2) % 12 ;

      ## ===========================
      ##安天鉞
      $you->{ziwei}->{"天鉞"}->{pos} = $property->{$you->{tian_gan}}->{"天鉞"};
      ##安天魁
      $you->{ziwei}->{"天魁"}->{pos} = $property->{$you->{tian_gan}}->{"天魁"};
      ##安陀羅 
      $you->{ziwei}->{"陀羅"}->{pos} = $property->{$you->{tian_gan}}->{"陀羅"};
      ##安擎羊
      $you->{ziwei}->{"擎羊"}->{pos} = $property->{$you->{tian_gan}}->{"擎羊"};
      ##安祿存
      $you->{ziwei}->{"祿存"}->{pos} = $property->{$you->{tian_gan}}->{"祿存"};
      ##天哭 = 午 - 出生年（支）-1
      $you->{ziwei}->{"天哭"}->{pos} = (&find_pos("q"=> \@di_zhi, "f"=>"午") -2 +12 - &find_pos("q"=> \@di_zhi, "f"=>$you->{di_zhi}) ) % 12;
      ##天虛 = 午 + 出生年（支）-1
      $you->{ziwei}->{"天虛"}->{pos} = (&find_pos("q"=> \@di_zhi, "f"=>"午") -2 + &find_pos("q"=> \@di_zhi, "f"=>$you->{di_zhi}) ) % 12;
      #紅鸞：在卯上起子逆算到生年安之。天喜：天喜都在紅鸞的對宮。
      $you->{ziwei}->{"紅鸞"}->{pos} = (&find_pos("q"=> \@di_zhi, "f"=>"卯") -2 +12- &find_pos("q"=> \@di_zhi, "f"=>$you->{di_zhi}) ) % 12;
      $you->{ziwei}->{"天喜"}->{pos} =  ($you->{ziwei}->{"紅鸞"}->{pos}+6) % 12;

      #print $you->{ziwei}->{"紅鸞"}->{pos};
      ###鈴星
      ### 亥卯未巳酉丑申子辰 生時
      ### 例 ： 鈴星 出生月 - 午 = 辰
      ##############
      ### 寅午戌 生時
      ### 例 ： 鈴星 出生月 - 午 = 酉

      my $dz = &find_pos("q"=> \@di_zhi , "f"=>$you->{di_zhi});

      if ($dz eq  0 || $dz eq 6 || $dz eq 10 ){
      $you->{ziwei}->{"鈴星"}->{pos} = ($time_num+1)%12;
      }else{
      $you->{ziwei}->{"鈴星"}->{pos} = ($time_num-4)%12;

      }
      ###火星
      ### 亥卯未 年
      ### 火星=生時寅 = 亥
      ### 例 ： 
      ##############
      ### 巳酉丑 年
      ### 火星=生時寅 = 巳
      ##############
      ### 申子辰 年
      ### 火星=生時寅 = 辰
      ##############
      ### 寅午戌 年
      ### 火星=生時寅 = 卯

      ### 巳酉丑 年
      if ($dz eq 5 ||$dz eq 9|| $dz eq 1 ){
	$you->{ziwei}->{"火星"}->{pos} = ($time_num+3-2)%12;
      ### 亥卯未 年
      }elsif ($dz eq  11 || $dz eq  3||  $dz eq  7){
	$you->{ziwei}->{"火星"}->{pos} = ($time_num+9-2)%12;

      ### 申子辰 年
      }elsif ($dz eq  8 || $dz eq  0||  $dz eq  4){
	$you->{ziwei}->{"火星"}->{pos} = ($time_num+2-2)%12;
      ### 寅午戌 年
      }elsif ($dz eq  2 || $dz eq  6  || $dz eq  10){
	$you->{ziwei}->{"火星"}->{pos} = ($time_num+13-2)%12;

      }


      ### 破碎星 
      ### （生年）子午卯酉= 巳
      ### （生年）寅申巳亥= 酉
      ### （生年）辰戌丑未= 丑
      $you->{ziwei}->{"破碎"}->{pos} = $property->{$you->{di_zhi}}->{"破碎"};

      ### 孤辰星 
      ### （生年）寅卯辰= 巳
      ### （生年）巳午未= 申
      ### （生年）申酉戌= 亥
      ### （生年）亥子丑= 寅
      $you->{ziwei}->{"孤辰"}->{pos} = $property->{$you->{di_zhi}}->{"孤辰"};

      ### 寡宿星 
      ### （生年）寅卯辰= 丑
      ### （生年）巳午未= 辰
      ### （生年）申酉戌= 未
      ### （生年）亥子丑= 戌
      $you->{ziwei}->{"寡宿"}->{pos} = $property->{$you->{di_zhi}}->{"寡宿"};

      ##大耗星：以生年地支推之。子(未)，丑(午)，寅(酉)，卯(申)，辰(亥)，巳(戌)
      ## 生年地支 双数 逆时 5步， 双数 顺时5步
      if ($dz % 2 eq 0){
	$you->{ziwei}->{"大耗"}->{pos} = ($dz -5-2)%12;
      }else{
	$you->{ziwei}->{"大耗"}->{pos} = ($dz +5-2)%12 ;
      }

      ##安將前十二星
      ##將星、攀鞍、歲馹(天馬)、息神、華蓋、劫煞、災煞、天煞、指背、咸池、月煞、亡神。
      ##生年
      ##亥卯未 = 卯 
      ##巳酉丑 = 酉
      ##申子辰 = 子
      ##寅午戌 = 午
      my $i;
      if ($dz eq 2 ||$dz eq 6|| $dz eq 10 ){
	$i=4;

      }elsif ($dz eq 0 ||$dz eq 8|| $dz eq 4 ){
	$i=10;
      }elsif ($dz eq 5 ||$dz eq 9|| $dz eq 1 ){
	  $i=7;

      }elsif ($dz eq 11 ||$dz eq 3|| $dz eq 7 ){
	$i=1;


      }

	      foreach my $z ("將星","攀鞍","天馬","息神","華蓋","劫煞","災煞","天煞","指背","咸池","月煞","亡神"){
		  $you->{ziwei}->{$z}->{pos} =  ($i++ %12) ;
	      }

      ##安歲前十二星：以生年太歲起順行 歲建、晦氣、喪門、貫索、官符、小耗、歲破(大耗)、龍德、白虎、天德、吊客、病符。
	my $i=$dz-2;
	      foreach my $z ("歲建","晦氣","喪門","貫索","官符","小耗","歲破","龍德","白虎","天德","吊客","病符"){
		  $you->{ziwei}->{$z}->{pos} =  ($i++ %12) ;
	      }

      #  $you->{ziwei}->{"歲建"}->{pos} =($i++ %12);
      #   $you->{ziwei}->{"晦氣"}->{pos} = ($i++ %12);
      #   $you->{ziwei}->{"喪門"}->{pos} = ($i++ %12);
      #   $you->{ziwei}->{"貫索"}->{pos} = ($i++ %12);
      #   $you->{ziwei}->{"官符"}->{pos} = ($i++ %12);
      #   $you->{ziwei}->{"小耗"}->{pos} = ($i++ %12);
      #   $you->{ziwei}->{"歲破"}->{pos} = ($i++ %12);
      #   $you->{ziwei}->{"龍德"}->{pos} = ($i++ %12);
      #   $you->{ziwei}->{"白虎"}->{pos} = ($i++ %12);
      #   $you->{ziwei}->{"天德"}->{pos} = ($i++ %12);
      #   $you->{ziwei}->{"吊客"}->{pos} = ($i++ %12);
      #   $you->{ziwei}->{"病符"}->{pos} = ($i++ %12);
      # 
      ##安長生十二星：按命宮五行局安之。陽男陰女順行，陰男陽女逆行。由其五行之長生位起。長生、沐浴、官帶、臨官、帝旺、衰、病、死、墓、絕、胎、養。
      ##水二局 - 長生 (申)  
      ##		陽男陰女順行 養(未) 
      ##		陰男陽女逆行 沐浴(未)
      ##火六局 - 長生 (寅) 
      ##		陽男陰女順行 養(丑) 
      ##		陰男陽女逆行 沐浴(丑)
      ##木三局 - 長生 (亥)
      ##		陽男陰女順行 養(戌) 
      ##		陰男陽女逆行 沐浴(戌)
      ##金四局 - 長生 (巳)
      ##		陽男陰女順行 養(辰) 
      ##		陰男陽女逆行 沐浴(辰)
      ##土五局 - 長生 (申)
      ##		陽男陰女順行 養(未) 
      ##		陰男陽女逆行 沐浴(未)


     ##安生年十二博士神(祿存) 陽男陰女順行，陰男陽女逆行
      ## 博士、力士、青龍、小耗、將軍、奏書、飛廉、喜神、病符、大耗、伏兵、官府。
      ## 官府 、伏兵、大耗、病符、喜神、飛廉、奏書、將軍、小耗、青龍、力士，博士


      my $i;
      if($you->{ju_su_num} eq 2  ){
	  $i=6;
      }elsif($you->{ju_su_num} eq 6  ){
	  $i=0;
      }elsif($you->{ju_su_num} eq 3  ){
	  $i=8;
      }elsif($you->{ju_su_num} eq 4  ){
	  $i=2;
      }elsif($you->{ju_su_num} eq 5  ){
	  $i=5;
      }


 
      my $j = $you->{ziwei}->{"祿存"}->{pos};

# 	for my $x (0..11){
# 	      if($you->{gong_gan}->{$x} =~ /$you->{tian_gan}/){
# 		$j = $x;
# 	      }
# 	  }



      #print $j."======";
	if(($you->{sex_yingyang} eq "阳" && $you->{sex} eq 0 ) || ($you->{sex_yingyang} eq "阴" && $you->{sex} eq 1 ) ){
	      ##顺
	      
	      foreach my $z ("沐浴","官帶","臨官","帝旺","衰","病","死","墓","絕","胎","養","長生"){
		  $you->{ziwei}->{$z}->{pos} =  ($i++ %12) ;
	      }

  	      foreach my $z ("博士","力士","青龍","小耗","將軍","奏書","飛廉","喜神","病符","大耗","伏兵","官府"){
		  $you->{ziwei}->{$z}->{pos} =  ($j++ %12) ;
	      }

	}elsif(($you->{sex_yingyang} eq "阴" && $you->{ sex} eq 0 ) || ($you->{sex_yingyang} eq "阳" && $you->{sex} eq 1 ) ){
	      ##逆
	      foreach my $z ("沐浴","長生","養","胎","絕","墓","死","病","衰","帝旺","臨官","官帶"){
		  $you->{ziwei}->{$z}->{pos} =  ($i++ %12) ;
	      }
	      foreach my $z ("博士","官府","伏兵","大耗","病符","喜神","飛廉","奏書","將軍","小耗","青龍","力士"){
		  $you->{ziwei}->{$z}->{pos} =  ($j++ %12) ;
	      }
	}


      ##大限
      ##   陽男陰女：在命宮起初限順行。每限各主十年之運。
      ##   陰男陽女：在命宮起初限逆行。每限各主十年之運。

      # 
      ##小限
      ##	     男女皆逆行。
      ##             寅午戌-辰，申子辰-戌，亥卯未-丑，巳酉丑-未。

      ##安流年斗君 : 歲建 【逆數生月，順數生時】
      ##安子年斗君 : 流年斗君 + 7

      $you->{"流年斗君"}->{pos}=  ((($you->{ziwei}->{"歲建"}->{pos} +13- $you->{month} ) )%12 +$time_num )%12;

      ###http://www.freehoro.net/ZWDS/Tutorial/PaiPan/19-0_Zi_Liu_NianDouJun.php
      #$you->{"子年斗君"}->{pos} =( $you->{"流年斗君"}->{pos}+$time_num )%12;
      $you->{"子年斗君"}->{pos} = (13- $you->{month} +$time_num -2)%12;

	
      # 看小儿命有“童限”的说法。
      # 起童的方法为：一命二财三疾厄，四妻五福六官禄。即一岁看命宫，二岁看财帛宫，三岁看疾厄宫，四岁看夫妻宫，五岁看福德宫，六岁看官禄宫。六岁后必已进入大限，进入大限后，则依大限而论，不必再看童限。
      # 童限的分析方法，可参看大限、流年的分析方法。
      # 看童限，亦宜以命身为体为本，并宜参看流年和小限。命身好童限不好，只不过有点小灾小疾而已，不致有大的问题，过此则好。命身不好，童限好者，主童年好养，亦不会有大的灾难发生，流年小限又吉者更吉，但若流年小限不吉者仍易有灾。命身不好，而童限又不好者，则有大凶之灾，甚则夭折，流年小限又不吉者必凶。
      # 其实，看小儿，完全可以命宫及小限流年来看。命宫主星为吉星守照，庙旺无煞，流年小限不犯七煞，流年不犯丧吊白虎，必无大害;流年小限凶者易有灾病，但一般还不致于有大灾大难发生。命宫主星为恶星，失陷加煞，小限又逢七煞，流年又逢丧吊白虎，是年必有奇灾大祸，甚则夭折。


      ##
      # 安截空星：甲己年申酉，乙庚年午未，丙辛年辰巳，丁壬年寅卯，戊癸年子丑。意思是：甲年或己年的截空星是申和酉，余类推。截空星分正空和副空，正空力大，副空力小。天干为阳者则在阳宫的空星为正空，在阴宫的空星为副空;天干为阴者则在阴宫的空星为正空，在阳宫的空星为副空。例如，甲年生人，申为正空，酉为副空;己年生人，酉为正空，申为副空。
      $you->{ziwei}->{"截空"}->{pos} = $property->{$you->{tian_gan}}->{"截空"};

      ##**紅艷：甲乙逢(午)丙見(寅)，戊己逢(辰)丁見(未)，庚(戌)辛(酉)壬(子)癸(申)。
      ##古訣有云：“癸臨申上丁見未，甲乙午申庚見戌，戊己怕辰壬怕子，六丙逢寅辛遇雞”。以八字日干起，四柱地支見即是。
      ##意思是說甲見午、乙見申、丙見寅、丁見未、戊見辰、己見辰、庚見戌、辛見酉、壬見子、癸見申。八字命局中，以出生日干查四支，見之者為是。如日干為己，四柱地支中有辰，即為紅艷煞。
      $you->{ziwei}->{"紅艷"}->{pos} = $property->{$you->{tian_gan}}->{"紅艷"};

      #########optional
      ##安台輔 - 午宮 + time -1
	$you->{ziwei}->{"台輔"}->{pos} =&find_pos("q"=> \@di_zhi , "f"=>"午") + $time_num-2;
      ##安封誥 - 寅宮 + time -1
	$you->{ziwei}->{"封誥"}->{pos} =&find_pos("q"=> \@di_zhi , "f"=>"寅") + $time_num-2;

      ##安解神 - (出生月) 1-2 = 申 3-4 = 戌  5- 6=子 7-8=寅 9-10=辰 11-12=午
      if($you->{month} eq 1 || $you->{month} eq 2){
	  $you->{ziwei}->{"解神"}->{pos} = &find_pos("q"=> \@di_zhi, "f"=>"申")-2;
      }elsif($you->{month} eq 3 || $you->{month} eq 4){
	  $you->{ziwei}->{"解神"}->{pos} = &find_pos("q"=> \@di_zhi, "f"=>"戌")-2;

      }elsif($you->{month} eq 5 || $you->{month} eq 6){
	  $you->{ziwei}->{"解神"}->{pos} = &find_pos("q"=> \@di_zhi, "f"=>"子")-2;

      }elsif($you->{month} eq 7 || $you->{month} eq 8){
	  $you->{ziwei}->{"解神"}->{pos} = &find_pos("q"=> \@di_zhi, "f"=>"寅")-2;

      }elsif($you->{month} eq 9 || $you->{month} eq 10){
	  $you->{ziwei}->{"解神"}->{pos} = &find_pos("q"=> \@di_zhi, "f"=>"辰")-2;

      }elsif($you->{month} eq 11 || $you->{month} eq 12){
	  $you->{ziwei}->{"解神"}->{pos} = &find_pos("q"=> \@di_zhi, "f"=>"午")-2;

      }
      

      ##安天巫 - (出生月) 9,1,5 =寅  6，10,2=亥 3,7,11=巳  12,4,8=申 [ month % 4 ]
      if(($you->{month}-2) % 4 eq 1 ){
		  $you->{ziwei}->{"天巫"}->{pos} = &find_pos("q"=> \@di_zhi, "f"=>"寅")-2;

      }elsif(($you->{month}-2) % 4 eq 2 ){
		  $you->{ziwei}->{"天巫"}->{pos} = &find_pos("q"=> \@di_zhi, "f"=>"亥")-2;

      }elsif(($you->{month}-2) % 4 eq 3 ){
		  $you->{ziwei}->{"天巫"}->{pos} = &find_pos("q"=> \@di_zhi, "f"=>"巳")-2;

      }elsif(($you->{month}-2) % 4 eq 0 ){
		  $you->{ziwei}->{"天巫"}->{pos} = &find_pos("q"=> \@di_zhi, "f"=>"申")-2;

      }


      ##安天月 - (出生月) 正月戌 二月巳 三月辰 四月寅 五月未 六月卯 七亥 八未 九寅 十月午 十一戌 十二天月寅。
      #$you->{"天月"}->{pos} = &find_pos("q"=> \@di_zhi, "f"=>$property->{$di_zhi[$you->{month}-1]}->{"天月"} )-2;
      $you->{ziwei}->{"天月"}->{pos} =  $property->{$di_zhi[$you->{month}-1]}->{"天月"};

      ##安三台 - 左輔 + 出生日 -1
      $you->{ziwei}->{"三台"}->{pos} = ($you->{ziwei}->{"左輔"}->{pos} + $you->{day} -1) %12;
      ##安八座 - 右弼 - 出生日 -1
      $you->{ziwei}->{"八座"}->{pos} = ($you->{ziwei}->{"右弼"}->{pos} + 13- $you->{day}) %12;

      ##安恩光 - 文昌 + 出生日 -1
      $you->{ziwei}->{"恩光"}->{pos} = ($you->{ziwei}->{"文昌"}->{pos} + $you->{day} -2) %12;

      ##安天貴 - 文曲 + 出生日 -1
      $you->{ziwei}->{"天貴"}->{pos} = ($you->{ziwei}->{"文曲"}->{pos}  + $you->{day} -2) %12;

      ##安天官 - (出生年-天干) - 甲=未 乙=龍/辰 壬=犬/戌，丙=蛇/巳 丁=虎/寅 己辛=雞/酉 戊=兔/卯 庚=豬/亥 癸=馬/午
      $you->{ziwei}->{"天官"}->{pos} =  $property->{$you->{tian_gan}}->{"天官"};

      ##安天福 - (出生年-天干) - 甲=雞/酉 乙=猴/申，丁=豬/亥 丙=鼠/子 己=寅 戊=兔/卯 庚壬=馬/午，辛癸=蛇/巳。
      $you->{ziwei}->{"天福"}->{pos} =  $property->{$you->{tian_gan}}->{"天福"};


       ##安蜚廉 (出生年-地支)  - 子=申 丑=酉 寅=戌 卯=巳 辰=午 巳=未 午=寅 未=卯 申=辰 酉=亥 戌=子 亥=丑。
      $you->{ziwei}->{"蜚廉"}->{pos} =  $property->{$you->{di_zhi}}->{"蜚廉"};

     ##安龍池 (出生年-地支) - 辰宮 + (地支数） -1
      $you->{ziwei}->{"龍池"}->{pos} =  2+&find_pos("q"=> \@di_zhi, "f"=>$you->{di_zhi});

      ##鳳閣池 (出生年-地支) - 戌宮 - (地支数） -1
      $you->{ziwei}->{"鳳閣"}->{pos} =  8+&find_pos("q"=> \@di_zhi, "f"=>$you->{di_zhi});


      ##安天才 (出生年-地支) - 命宫 + (地支数） -1
      $you->{ziwei}->{"天才"}->{pos} =  ( $you->{gong_wei}->{"命宫"} + &find_pos("q"=> \@di_zhi, "f"=>$you->{di_zhi}) )%12;

      ##安天壽 (出生年-地支) - 命宫 + (地支数） -1
      $you->{ziwei}->{"天壽"}->{pos} =  ( $you->{gong_wei}->{"命宫"} +12- &find_pos("q"=> \@di_zhi, "f"=>$you->{di_zhi}) )%12;

      ##安旬空 (出生年-地支) ceil(&combination("tian"=>$you->{tian_gan},"di"=>$you->{di_zhi})/10) = 1 (戌/亥) 2 (申/酉) 3 (午/未) 4 (辰/巳)  5(寅/卯) 6(子/丑)
       my $i = ceil(&combination("tian"=>$you->{tian_gan},"di"=>$you->{di_zhi})/10);
      if($i eq 1 ){
	    $you->{ziwei}->{"旬空"}->{pos} =8;
      }elsif($i eq 2 ){
	    $you->{ziwei}->{"旬空"}->{pos} =6;
      }elsif($i eq 3 ){
	    $you->{ziwei}->{"旬空"}->{pos} =4;
      }elsif($i eq 4 ){
	    $you->{ziwei}->{"旬空"}->{pos} =2;
      }elsif($i eq 5 ){
	    $you->{ziwei}->{"旬空"}->{pos} =0;
      }elsif($i eq 6 ){
	    $you->{ziwei}->{"旬空"}->{pos} =10;
      }
 
      ##安天傷、天使訣：天傷永在奴僕宮，天使永在疾厄宮。
      $you->{ziwei}->{"天傷"}->{pos} = $you->{gong_wei}->{"交友宫"};
      $you->{ziwei}->{"天使"}->{pos} = $you->{gong_wei}->{"疾厄宫"};

    #foreach my $d ($you->{gong_gan}){
	foreach my $k  (keys %{$you->{ziwei}}){
	    #if($property->{$d}->{$k}){
	      $you->{ziwei}->{$k}->{bright} = $property->{$di_zhi[($you->{ziwei}->{$k}->{pos}+2) %12]}->{$k};
	   # }
	}
#   }
      
  return $you
}

